* Design, implement and verify an array.
Simple array: variable size cell, custom capacity.
** Design the API
:LOGBOOK:
CLOCK: [2016-08-03 Mit 15:21]--[2016-08-03 Mit 15:24] =>  0:03
CLOCK: [2016-08-03 Mit 11:24]--[2016-08-03 Mit 12:11] =>  0:47
CLOCK: [2016-08-03 Mit 11:14]--[2016-08-03 Mit 11:16] =>  0:02
CLOCK: [2016-08-03 Mit 11:00]--[2016-08-03 Mit 11:12] =>  0:12
CLOCK: [2016-08-03 Mit 10:08]--[2016-08-03 Mit 10:25] =>  0:17
:END:
** Implement the API
:LOGBOOK:
CLOCK: [2016-08-07 Son 15:34]--[2016-08-07 Son 15:42] =>  0:08
CLOCK: [2016-08-03 Mit 15:24]--[2016-08-03 Mit 15:31] =>  0:07
CLOCK: [2016-08-03 Mit 11:16]--[2016-08-03 Mit 11:24] =>  0:08
CLOCK: [2016-08-03 Mit 11:12]--[2016-08-03 Mit 11:14] =>  0:02
:END:
** Formalize the API with VeriFast contracts
:LOGBOOK:
CLOCK: [2016-09-16 Fre 18:20]--[2016-09-16 Fre 18:22] =>  0:02
CLOCK: [2016-08-26 Fre 21:37]--[2016-08-26 Fre 21:41] =>  0:04
CLOCK: [2016-08-26 Fre 11:15]--[2016-08-26 Fre 11:37] =>  0:22
CLOCK: [2016-08-17 Mit 12:56]--[2016-08-17 Mit 12:59] =>  0:03
CLOCK: [2016-08-14 Son 14:04]--[2016-08-14 Son 14:37] =>  0:33
CLOCK: [2016-08-09 Die 20:21]--[2016-08-09 Die 20:29] =>  0:08
CLOCK: [2016-08-09 Die 18:16]--[2016-08-09 Die 18:26] =>  0:10
CLOCK: [2016-08-07 Son 11:07]--[2016-08-07 Son 11:15] =>  0:08
CLOCK: [2016-08-03 Mit 15:24]--[2016-08-03 Mit 15:24] =>  0:00
CLOCK: [2016-08-03 Mit 15:21]--[2016-08-03 Mit 15:21] =>  0:00
CLOCK: [2016-08-03 Mit 14:03]--[2016-08-03 Mit 14:33] =>  0:30
CLOCK: [2016-08-03 Mit 13:28]--[2016-08-03 Mit 13:54] =>  0:26
:END:
** Write a symbolic model
:LOGBOOK:
CLOCK: [2016-09-17 Sam 17:04]--[2016-09-17 Sam 17:05] =>  0:01
CLOCK: [2016-08-31 Mit 11:46]--[2016-08-31 Mit 11:55] =>  0:09
CLOCK: [2016-08-30 Die 16:10]--[2016-08-30 Die 16:21] =>  0:11
CLOCK: [2016-08-27 Sam 11:33]--[2016-08-27 Sam 11:38] =>  0:05
CLOCK: [2016-08-26 Fre 11:37]--[2016-08-26 Fre 12:01] =>  0:24
CLOCK: [2016-08-06 Sam 18:17]--[2016-08-06 Sam 18:36] =>  0:19
CLOCK: [2016-08-06 Sam 18:05]--[2016-08-06 Sam 18:11] =>  0:06
CLOCK: [2016-08-05 Fre 19:04]--[2016-08-05 Fre 19:11] =>  0:07
CLOCK: [2016-08-03 Mit 21:09]--[2016-08-03 Mit 21:11] =>  0:02
CLOCK: [2016-08-03 Mit 18:36]--[2016-08-03 Mit 18:46] =>  0:10
CLOCK: [2016-08-03 Mit 17:26]--[2016-08-03 Mit 17:31] =>  0:05
CLOCK: [2016-08-03 Mit 17:16]--[2016-08-03 Mit 17:18] =>  0:02
CLOCK: [2016-08-03 Mit 16:53]--[2016-08-03 Mit 17:08] =>  0:15
CLOCK: [2016-08-03 Mit 15:31]--[2016-08-03 Mit 15:39] =>  0:08
:END:
** Write a validator plugin
:LOGBOOK:
CLOCK: [2016-09-17 Sam 16:53]--[2016-09-17 Sam 16:55] =>  0:02
CLOCK: [2016-08-30 Die 21:31]--[2016-08-30 Die 21:38] =>  0:07
CLOCK: [2016-08-28 Son 14:25]--[2016-08-28 Son 14:29] =>  0:04
CLOCK: [2016-08-27 Sam 11:10]--[2016-08-27 Sam 11:33] =>  0:23
CLOCK: [2016-08-26 Fre 21:41]--[2016-08-26 Fre 21:44] =>  0:03
CLOCK: [2016-08-26 Fre 15:11]--[2016-08-26 Fre 15:30] =>  0:19
CLOCK: [2016-08-26 Fre 10:58]--[2016-08-26 Fre 11:10] =>  0:12
CLOCK: [2016-08-23 Die 12:33]--[2016-08-23 Die 12:40] =>  0:07
CLOCK: [2016-08-17 Mit 12:59]--[2016-08-17 Mit 13:02] =>  0:03
CLOCK: [2016-08-14 Son 15:07]--[2016-08-14 Son 15:08] =>  0:01
CLOCK: [2016-08-11 Don 22:12]--[2016-08-11 Don 22:18] =>  0:06
CLOCK: [2016-08-09 Die 20:39]--[2016-08-09 Die 20:41] =>  0:02
CLOCK: [2016-08-09 Die 20:29]--[2016-08-09 Die 20:34] =>  0:05
CLOCK: [2016-08-09 Die 18:31]--[2016-08-09 Die 18:35] =>  0:04
CLOCK: [2016-08-07 Son 11:15]--[2016-08-07 Son 11:19] =>  0:04
CLOCK: [2016-08-06 Sam 20:30]--[2016-08-06 Sam 20:32] =>  0:02
CLOCK: [2016-08-06 Sam 20:05]--[2016-08-06 Sam 20:22] =>  0:17
:END:
** Verify the implementation
:LOGBOOK:
CLOCK: [2016-09-17 Sam 16:07]--[2016-09-17 Sam 16:36] =>  0:29
CLOCK: [2016-09-17 Sam 15:32]--[2016-09-17 Sam 15:49] =>  0:17
CLOCK: [2016-09-17 Sam 15:03]--[2016-09-17 Sam 15:31] =>  0:28
CLOCK: [2016-09-17 Sam 14:20]--[2016-09-17 Sam 14:45] =>  0:25
CLOCK: [2016-09-17 Sam 13:57]--[2016-09-17 Sam 14:05] =>  0:08
CLOCK: [2016-09-17 Sam 12:59]--[2016-09-17 Sam 13:43] =>  0:44
CLOCK: [2016-09-17 Sam 11:15]--[2016-09-17 Sam 11:49] =>  0:34
CLOCK: [2016-09-17 Sam 11:12]--[2016-09-17 Sam 11:13] =>  0:01
CLOCK: [2016-09-17 Sam 10:58]--[2016-09-17 Sam 11:08] =>  0:10
CLOCK: [2016-09-17 Sam 10:09]--[2016-09-17 Sam 10:45] =>  0:36
CLOCK: [2016-09-17 Sam 09:52]--[2016-09-17 Sam 10:06] =>  0:14
CLOCK: [2016-09-17 Sam 09:26]--[2016-09-17 Sam 09:47] =>  0:21
CLOCK: [2016-09-17 Sam 09:15]--[2016-09-17 Sam 09:19] =>  0:04
CLOCK: [2016-09-16 Fre 23:31]--[2016-09-17 Sam 00:37] =>  1:06
CLOCK: [2016-09-16 Fre 23:22]--[2016-09-16 Fre 23:30] =>  0:08
:END:
